// НАСТРОЙКИ КОРПУСА
cell = 1;             // Размер мм
thickness = 8;        // Толщина (высота) основания клавиатуры в мм
roundness = 4;        // Радиус скругления углов в мм

// Включаем сглаживание окружностей
$fn = 60;

// Сборка 3D модели
linear_extrude(height = thickness) {
    smooth_body(r = roundness);
}

// Модуль для скругления контура
module smooth_body(r) {
    offset(r = r) {
        offset(r = -r) {
            keyboard_contour();
        }
    }
}

// Базовый контур по точкам (координаты в клетках, умноженные на cell)
module keyboard_contour() {
    polygon(points = [
        [0 ,   0 ],     
        [0 ,   55 ],    
        [35 ,   55 ],    
        [41 ,  62 ],  
        [55 ,  62 ],  
        [62 ,  66 ],    
        [80 ,  65 ],    
        [88 , 60 ],    
        [100 ,  58 ],    
        [105 ,  55 ], 
        [115 ,  54 ],    
        [120 ,  50 ],
        [120 ,  45 ],
        [135 ,  44 ],
        [140 ,  40 ],
        [140 ,  40 ],
        [135 ,  -20 ],
        [125 ,  -35 ],
        [117 ,  -35 ],
        [75 ,  -19 ],
        [65 ,  -10 ],
        [55 ,  -10 ],
        [50 ,  -5 ],
        [5 ,   -5 ]      
    ]);
}